app/views/workouts/show.html.erb

SELECT "movements".* FROM "movements" WHERE "movements"."id" IN (4, 5)
---
<% content_for :title, "Workout" %>
<% exercise_entries = @workout.exercise_entries.includes(:movement).ordered.to_a %>

SELECT "movements".* FROM "movements" WHERE "movements"."id" = 1
---
                  </h3>
                  <% if entry.movement.respond_to?(:tag) && entry.movement.tag.present? %>