app/views/workouts/show.html.erb

    </div>
    <% if @workout.exercise_entries.any? %>
      <div class="mt-6 space-y-3">
        <% @workout.exercise_entries.includes(:movement).ordered.each do |entry| %>
---
SELECT 1 AS one FROM "exercise_entries" WHERE "exercise_entries"."workout_id" = 7 LIMIT 1
SELECT "movements".* FROM "movements" WHERE "movements"."id" IN (4, 5)