app/views/exercise_entries/_form.html.erb

      <%= form.label :movement_id, "Movement", class: "block text-sm font-bold text-zinc-200" %>
      <%= form.collection_select :movement_id,
            Movement.order(:name),
            :id,
            :name,
            { prompt: "Choose a movement" },
            class: "mt-2 block w-full rounded-xl border border-white/10 bg-zinc-950 px-4 py-3 text-zinc-100 shadow-sm outline-none transition focus:border-amber-400/50 focus:ring-2 focus:ring-amber-400/20" %>
---
SELECT "movements".* FROM "movements" ORDER BY "movements"."name" ASC