app/controllers/exercise_entries_controller.rb

  def create
    @exercise_entry = @workout.exercise_entries.build(exercise_entry_params)

    if @exercise_entry.save
---
INSERT INTO "exercise_entries" ("workout_id", "movement_id", "sets", "reps", "weight", "notes", "position", "created_at", "updated_at") VALUES (7, 1, 5, 3, 245.0, 'Felt good. I''m a beast!', NULL, '2026-06-20 23:04:44.908957', '2026-06-20 23:04:44.908957') RETURNING "id"

  def update
    if @exercise_entry.update(exercise_entry_params)
---
UPDATE "exercise_entries" SET "weight" = 250.0, "updated_at" = '2026-06-20 23:05:41.816141' WHERE "exercise_entries"."id" = 1

  def destroy
    @exercise_entry.destroy
---
DELETE FROM "exercise_entries" WHERE "exercise_entries"."id" = 1

  def set_workout
    @workout = Workout.find(params[:workout_id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 7 LIMIT 1

  def set_exercise_entry
    @exercise_entry = @workout.exercise_entries.find(params[:id])
---
SELECT "exercise_entries".* FROM "exercise_entries" WHERE "exercise_entries"."workout_id" = 7 AND "exercise_entries"."id" = 1 LIMIT 1