app/controllers/movements_controller.rb

SELECT "movements".* FROM "movements"
---
  def index
    @movements = Movement.all

INSERT INTO "movements" ("name", "current_cue", "progression_rule", "notes", "created_at", "updated_at") VALUES ('Bench Press', 'Focus on Leg Drive', 'Own 145 3X8', 'Goal is a high-quality path toward a 315 squat. Prioritize depth, upper-back tightness, and repeatable form over rushing weight increases.', '2026-06-20 15:54:33.962948', '2026-06-20 15:54:33.962948') RETURNING "id"
---
  def create
    @movement = Movement.new(movement_params)

    respond_to do |format|
      if @movement.save

SELECT "movements".* FROM "movements" WHERE "movements"."id" = 1 LIMIT 1
---
    def set_movement
      @movement = Movement.find(params.expect(:id))