app/controllers/workouts_controller.rb

INSERT INTO "workouts" ("date", "workout_type", "raw_notes", "created_at", "updated_at") VALUES ('2026-06-19', 'Lower', '#sumoDeadlift
---
  def create
    @workout = Workout.new(workout_params)

    respond_to do |format|
      if @workout.save

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 10 LIMIT 1
---
  def set_workout
    @workout = Workout.find(params.expect(:id))

SELECT 1 AS one FROM "exercise_entries" WHERE "exercise_entries"."workout_id" = 11 LIMIT 1
---
  def build_empty_exercise_entries
    @workout.exercise_entries.build if @workout.exercise_entries.empty?